Revit 2026 API

# WorksetPreviewId Property

---

Id of the workset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WorksetId Id { get; }
```
```vb
Public ReadOnly Property Id As WorksetId
	Get
```
```cpp
public:
property WorksetId^ Id {
	WorksetId^ get ();
}
```
```fsharp
member Id : WorksetId with get
```

#### Property Value

WorksetId

Id of the workset may be changed while synchronizing with central. Please use UniqueId to reliably identify worksets despite changes which occur due to synchronization with central.

#### Reference

WorksetPreview Class

Autodesk.Revit.DB Namespace